#  PANDAS Series

In [1]:
import pandas as pd

In [2]:
list_1 = [1,2,-3,4.5,2]
print(list_1)

[1, 2, -3, 4.5, 2]

In [3]:
series1 = pd.Series(list_1)
print(series1)

0    1.0
1    2.0
2   -3.0
3    4.5
4    2.0
dtype: float64

In [4]:
type(series1)

pandas.core.series.Series

In [5]:
# empty series
empty_s = pd.Series([])
print(empty_s)

Series([], dtype: float64)

D:\python\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

In [6]:
series3 = pd.Series( [4,4,2,3] , index = ['a',2,'c','4'] ,
                   dtype = float , name = 'data values')
print(series3)

a    4.0
2    4.0
c    2.0
4    3.0
Name: data values, dtype: float64

In [7]:
# methord 2
series2 = pd.Series([1,2,3,4.5,'aj'])
print(series2)

0      1
1      2
2      3
3    4.5
4     aj
dtype: object

In [8]:
s3_scalar = pd.Series(2)
print(s3_scalar)

0    2
dtype: int64

In [9]:
s4_scalar = pd.Series(2, index =[1,'a', 3] )
print(s4_scalar)

1    2
a    2
3    2
dtype: int64

In [10]:
print( series1 )
print( series2 )

0    1.0
1    2.0
2   -3.0
3    4.5
4    2.0
dtype: float64
0      1
1      2
2      3
3    4.5
4     aj
dtype: object

In [11]:
#slicing

In [12]:
series2[0:3]  # (a, b]

0    1
1    2
2    3
dtype: object

In [13]:
print( series1 )
print( max(series1) )
print( min(series1) )
print( [ series1 < 4] )
print( series1.drop(4) )

0    1.0
1    2.0
2   -3.0
3    4.5
4    2.0
dtype: float64
4.5
-3.0
[0     True
1     True
2     True
3    False
4     True
dtype: bool]
0    1.0
1    2.0
2   -3.0
3    4.5
dtype: float64

In [14]:
s1 = pd.Series([1,2,3,4])
s2 = pd.Series([4,3,2]) #handle missing value

In [15]:
print(s1+s2)

0    5.0
1    5.0
2    5.0
3    NaN
dtype: float64

In [16]:
s4_dict = pd.Series(  {'a':1, 'b':2, 'c':3}  )
print(s4_dict)

a    1
b    2
c    3
dtype: int64

# Pandas Dataframe

In [17]:
# empty dataframes
emt_df = pd.DataFrame()
print(emt_df)

Empty DataFrame
Columns: []
Index: []

In [18]:
lst = ['a', 'b', 'c']   # First creating a list
df1 = pd.DataFrame(lst)    # Creating dataframe from above list
df1

   0
0  a
1  b
2  c

In [19]:
# dataframes from list of list
ls_of_ls = [ [1,2,3], [2,3,4], [4,5,6] ]   # Creating list of list
df2 = pd.DataFrame(ls_of_ls)# Creating dataframe form above list of list
df2

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [20]:
# dataframes by dictionary
dict1 = {'ID': [11,22,33,44]}   # Creating dict
df3 = pd.DataFrame( dict1 )
df3

   ID
0  11
1  22
2  33
3  44

In [21]:
# dataframe from dictionary
dict2 = { 'ID': [11,22,33,44], 'SN': [1,2,3,4]  }
df4 = pd.DataFrame( dict2 )   # can't handle missing values
df4

   ID  SN
0  11   1
1  22   2
2  33   3
3  44   4

In [22]:
#  dataframe from list of dictionary
ls_dict = [ {'a':1, 'b':2}, {'a':3, 'b':4} ]   # Creating list of dict
df5 = pd.DataFrame(ls_dict)   # Creating dataframe from list of dict
df5                             # handle misssing

   a  b
0  1  2
1  3  4

In [23]:
#  dataframe from dict of series
dict_sr = { 'ID': pd.Series([1,2,3]), 'SN': pd.Series([111,222,333]) }
df7 = pd.DataFrame(dict_sr)
df7

   ID   SN
0   1  111
1   2  222
2   3  333

# Read and Write csv file

In [24]:
df = pd.read_csv('Fortune_10.csv')
df.head(3)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%

In [25]:
print( type(df) )
print( df.columns )

<class 'pandas.core.frame.DataFrame'>
Index(['ID', 'Name', 'Industry', 'Inception', 'Revenue', 'Expenses', 'Profit',
       'Growth'],
      dtype='object')

In [26]:
df = pd.read_csv('Fortune_10.csv', nrows = 1)
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%

In [27]:
df=pd.read_csv('Fortune_10.csv', usecols = [0,3] ) #index of column
df

   ID  Inception
0   1       2009
1   2       2010
2   3       2012
3   4       2013
4   5       2009
5   6       2006
6   7       2010
7   8       2009
8   9       2011
9  10       2011

In [28]:
df = pd.read_csv('Fortune_10.csv', skiprows = 1) # skip No of rows
df.head(3)

,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
0,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
1,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
2,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%

In [31]:
df = pd.read_csv('Fortune_10.csv', skiprows = [0])
df.head(5)

,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
0,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
1,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
2,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
3,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
4,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%

# Handling Missing Values

In [37]:
df = pd.read_csv('Fortune_10_Missing.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553.0,30%
1,2,no value,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916.0,20%
2,3,Canecorporation,not avail,2012,"$10,597,009","7,591,189 Dollars",NaN,7%
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",NaN,26%
4,5,Techdrill,NaN,2009,"$10,573,990","7,435,363 Dollars",3138627.0,8%
5,6,Techline,NaN,2006,"$13,898,119","5,470,303 Dollars",8427816.0,23%
6,7,Cityace,NaN,2010,"$9,254,614","6,249,498 Dollars",3005116.0,6%
7,8,Kayelectronics,NaN,2009,"$9,451,943","3,878,113 Dollars",5573830.0,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180.0,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060.0,7%

In [39]:
df = pd.read_csv('Fortune_10_Missing.csv', na_values = ['no value', 'not avail'])
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553.0,30%
1,2,NaN,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916.0,20%
2,3,Canecorporation,NaN,2012,"$10,597,009","7,591,189 Dollars",NaN,7%
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",NaN,26%
4,5,Techdrill,NaN,2009,"$10,573,990","7,435,363 Dollars",3138627.0,8%
5,6,Techline,NaN,2006,"$13,898,119","5,470,303 Dollars",8427816.0,23%
6,7,Cityace,NaN,2010,"$9,254,614","6,249,498 Dollars",3005116.0,6%
7,8,Kayelectronics,NaN,2009,"$9,451,943","3,878,113 Dollars",5573830.0,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180.0,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060.0,7%